#+Title: Intro to Promise Theory and CFEngine
#+Author: Nick Anderson
#+Email: nick@cmdln.org
#+Subtitle: Building Stable Relationships - CS444 Linux Essentials
#+REVEAL_ROOT: reveal.js-3.6.0
#+OPTIONS: reveal_title_slide:"<h2>%t</h2><h3>%d</h3><h4>%s</h4>" 
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: toc:nil tags:nil reveal_slide_number:c/t 
#+REVEAL_TRANS: convex
#+REVEAL_THEME: white
#+REVEAL_HLEVEL: 2
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Presentation slides">
#+REVEAL_POSTAMBLE: <p> Created by %a </p>
#+REVEAL_PLUGINS: (markdown notes highlight print-pdf)
#+OPTIONS: reveal_single_file:nil
#+EXCLUDE_TAGS: noexport
#+MACRO: color @@html:<font color="$1">$2</font>@@

* Setup                                                            :noexport:

# https://www.reddit.com/r/emacs/comments/79lwwo/am_i_misunderstanding_orgreveal_or_reaching_the/

Export to PDF without jumping through hoops

#+BEGIN_SRC shell :dir /sudo::// :results output
  apt install phantomjs

#+END_SRC

#+RESULTS:
: Reading package lists... 0%Reading package lists... 100%Reading package lists... Done
: Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 50%Building dependency tree... 50%Building dependency tree       
: Reading state information... 0%Reading state information... 0%Reading state information... Done
: phantomjs is already the newest version (2.1.1+dfsg-2).
: 0 upgraded, 0 newly installed, 0 to remove and 24 not upgraded.

#+BEGIN_SRC emacs-lisp
  (defun reveal-to-pdf ()
   "print reveal.js slides to pdf"
   (interactive)
   (async-shell-command "phantomjs /home/nickanderson/src/reveal.js/plugin/print-pdf/print-pdf.js 
                        'file:///home/nickanderson/src/presentations/introduction-to-promise-theory/README.html?print-pdf'")) 
#+END_SRC

#+RESULTS:
: reveal-to-pdf
   
*** Example Promise

#+BEGIN_SRC cfengine3 :exports both
  bundle agent main {
    files:
      linux::
        "/tmp/example" -> { "Instructor", "Students" }
          create => "true",
          touch => "true",
          action => warn_only;
  }
#+END_SRC

#+RESULTS:
:  warning: Need to touch (update time stamps) for '/tmp/multiple-attributes', but only a warning was promised!

#+BEGIN_NOTES
  - This is a promise of *type* =files=.
  - This promise has a *class context* of =linux= (it will only apply if running a
    Linux kernel).
  - The *promiser* is the POSIX path =/tmp/example=.
  - This promise has three *attribute*, specifying that the file should be
    created if it does not exist, it's timestamp should be updated, and only
    warn about what the agent would do.
  - The *promisee* is both of us
  - To create a directory instead, use a =files:= promise and append a =.= to the
    directory name (e.g., =/tmp/hello/.=)
#+END_NOTES

